app/controllers/class_lists_controller.rb

SELECT "class_lists".* FROM "class_lists"
SELECT "class_statuses".* FROM "class_statuses" WHERE "class_statuses"."user_id" = $1  [["user_id", 2]]
---
  def index
    @class_lists = ClassList.all
	@my_class_lists = ClassStatus.where(user_id: current_user.id)

INSERT INTO "class_lists" ("c_name", "c_account", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["c_name", "오픈소스"], ["c_account", 2], ["created_at", "2020-11-03 07:44:34.506465"], ["updated_at", "2020-11-03 07:44:34.506465"]]
---
  def create
    @class_list = ClassList.new(class_list_params)

    respond_to do |format|
      if @class_list.save

DELETE FROM "class_lists" WHERE "class_lists"."id" = $1  [["id", 1]]
---
  def destroy
    @class_list.destroy

SELECT  "class_lists".* FROM "class_lists" WHERE "class_lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_class_list
      @class_list = ClassList.find(params[:id])