app/controllers/class_statuses_controller.rb

SELECT "class_statuses".* FROM "class_statuses"
---
  def index
    @class_statuses = ClassStatus.all

SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."user_id" = $1 AND "class_statuses"."class_list_id" = $2  [["user_id", 1], ["class_list_id", 1]]
SELECT COUNT(*) FROM "class_statuses" WHERE "class_statuses"."class_list_id" = $1  [["class_list_id", 1]]
SELECT  "class_lists".* FROM "class_lists" WHERE "class_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "class_statuses" ("user_id", "class_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["class_list_id", 1], ["created_at", "2020-11-03 07:35:48.006672"], ["updated_at", "2020-11-03 07:35:48.006672"]]
---
  def create
    @class_status = ClassStatus.new(class_status_params)
	user_id = @class_status.user_id
	class_id = @class_status.class_list_id
	@class_status_overlap = ClassStatus.where(user_id: user_id, class_list_id: class_id).size
	@class_status_size = ClassStatus.where(class_list_id: class_id).size
	puts "현재 사이즈 수 : #{@class_status_overlap}"
	puts "유저ID : #{user_id}"
	puts "강의ID : #{class_id}"

    respond_to do |format|
		if @class_status_overlap > 0
			format.html { redirect_to root_path, notice: '중복신청은 되지 않습니다.'}
		elsif @class_status_size >= ClassList.find(class_id).c_account
			format.html { redirect_to root_path, notice: '수강인원을 초과할수 없습니다.'}
	  	else
		 @class_status.save

DELETE FROM "class_statuses" WHERE "class_statuses"."id" = $1  [["id", 1]]
---
  def destroy
    @class_status.destroy

SELECT  "class_statuses".* FROM "class_statuses" WHERE "class_statuses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_class_status
      @class_status = ClassStatus.find(params[:id])